// ** Mui Imports
import {
  Button,
  Typography,
  Dialog,
  DialogContent,
  DialogActions,
} from "@mui/material";

interface IProps {
  open: boolean;
  setOpen: (value: boolean) => void;
}

const TermsConditionsModalUk = (props: IProps) => {
  // ** Props
  const { open, setOpen } = props;

  const handleClose = () => setOpen(false);

  return (
    <Dialog
      open={open}
      scroll={"paper"}
      onClose={handleClose}
      maxWidth="md"
      fullWidth={true}
      aria-labelledby="scroll-dialog-title"
      aria-describedby="scroll-dialog-description"
    >
      <DialogContent dividers={true}>
        <Typography variant="h6">1. Прийняття</Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ці умови використання buzznodes.com разом з нашою політикою
          конфіденційності та всіма іншими додатковими умовами та відомостями,
          які можуть надаватися в рамках Сервісу (далі «Умови»), регулюють
          використання вами сервісу, сайту, контенту та програмного забезпечення
          (далі «Сервіс»). Реєстрація в Сервісі або використання його повністю
          або частково означає, що Ви приймаєте ці Умови.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Умови є угодою між вами та автором, правовласником buzznodes.com (далі
          іменується «buzznodes.com»), яка визначає права та обов'язки щодо
          Сервісу з вашого боку та з боку buzznodes.com.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          2. Реєстрація та припинення дії
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Щоб користуватися Сервісом, вам знадобиться зареєструватися та
          створити обліковий запис з емейлом, на який можуть поширюватися інші
          умови. Перш ніж дозволити використання облікового запису,
          buzznodes.com може перевірити вашу адресу електронної пошти.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ви, а також у разі вашого неповноліття ваш батько чи законний опікун,
          несете особисту відповідальність за будь-яке використання Сервісу.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Якщо ви більше не бажаєте використовувати Сервіс, ви маєте право
          припинити дію вашої реєстрації. Після припинення дії реєстрації доступ
          до Сервісу буде закритий.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com може припинити або обмежити ваш доступ до певних частин
          Сервісу, якщо buzznodes.com обґрунтовано вважає, що ви порушили Умови,
          або після попереднього повідомлення, якщо ви не користувалися Сервісом
          під своїм унікальним токеном доступу. За винятком випадків,
          передбачених політикою конфіденційності, buzznodes.com не несе
          відповідальності за будь-яке видалення чи втрату інформації чи
          контенту, наданого вами на Сервіс.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          3. Ліцензії
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com надає вам невиключну ліцензію без права передачі, яка
          може бути відкликана в будь-який час на власний розсуд buzznodes.com,
          на доступ та використання Сервісу у суворій відповідності до Умов.
          Використання Сервісу не надає вам жодних прав на об'єкти
          інтелектуальної власності щодо будь-якої інформації чи контенту на
          Сервісі.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Деякий Контент може бути доступним лише для мешканців певних
          географічних областей. Ви повинні дотримуватися обмежень, застосовних
          до конкретного Контенту, який ви отримуєте за допомогою Сервісу.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com надає вам обмежене, невиключне, не підлягає передачі
          право на встановлення та використання Програмного забезпечення на
          вашому комп'ютері та/або сервері. Ви не маєте права розповсюджувати
          свій токен, передавати право на використання, модифікувати,
          переводити, відтворювати, перепродавати, субліцензувати, здавати в
          оренду або лізинг, здійснювати зворотний інжиніринг або іншим чином
          намагатися отримати вихідний код або створювати похідні Програмного
          забезпечення.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ви погоджуєтесь суворо дотримуватись усіх положень законодавства, що
          регулює імпорт та експорт, і підтверджуєте, що відповідаєте за
          отримання ліцензій, необхідних для експорту, реекспорту, передачі або
          імпорту такого ПЗ.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ви можете надавати інформацію або контент (матеріал) Сервісу.
          buzznodes.com не претендує на право власності на ваш матеріал. Надаючи
          Матеріал, ви не передаєте buzznodes.com право власності на нього.
          buzznodes.com тільки передає Матеріал і не повинна контролювати його
          зміст.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ви несете єдину відповідальність за створення резервних копій даних,
          які Ви зберігаєте на Сервісі, в тому числі завантаженого Вами на
          Сервіс Контенту.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          4. Використання Сервісу
        </Typography>
        <Typography component={"span"} variant="body2" sx={{ mt: 4 }}>
          Ви погоджуєтесь:
          <ul>
            <li>дотримуватися чинних законів, Умов та правил поведінки;</li>
            <li>використовувати Сервіс лише в особистих цілях;</li>
            <li>
              не надавати Матеріалу незаконного, агресивного, неточного, що
              вводить в оману, образливого, порнографічного, загрозливого,
              наклепницького чи іншого недоречного характеру;
            </li>
            <li>
              отримувати будь-які згоди, дозволи або ліцензії, які можуть
              вимагатися відповідно до законодавства для надання Матеріалу;
            </li>
            <li>поважати приватне життя інших людей;</li>
            <li>
              не розповсюджувати та не публікувати спам, «листи щастя», схеми
              фінансових пірамід, віруси;
            </li>
            <li>
              не використовувати будь-які інші технології та не ініціювати інші
              дії, які можуть завдати шкоди Сервісу або інтересам чи власності
              користувачів Сервісу;
            </li>
            <li>
              нести відповідальність за наслідки, пов'язані з розміщенням вами
              Матеріалу;
            </li>
            <li>
              не повідомляти та не розповсюджувати свій токен третім особам.
            </li>
          </ul>
          buzznodes.com може, але не зобов'язана:
          <ul>
            <li>контролювати або модерувати будь-який Контент або Матеріал;</li>
            <li>видалити будь-який Матеріал із Сервісу;</li>
            <li>
              обмежувати доступ до будь-якої частини Сервісу в будь-який час на
              власний розсуд.
            </li>
          </ul>
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          5. Контент
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com не несе відповідальності за будь-які претензії або
          образи, що виникають або завдані вам у результаті отримання доступу до
          Контенту на Сервісі.
        </Typography>
        <Typography component={"span"} variant="body2" sx={{ mt: 4 }}>
          Ви погоджуєтесь:
          <ul>
            <li>використовувати Контент лише з метою;</li>
            <li>
              не копіювати, не віддавати, не продавати, не перепродувати, не
              позичати, не орендувати, не пропонувати, не транслювати, не
              відправляти, не поширювати, не передавати, не доводити до
              загальної інформації, не відтворювати, не змінювати, не
              демонструвати , не виконувати, не використовувати в комерційних
              цілях і не надавати доступ до Контенту, якщо інше не дозволено у
              застосовних Умовах, з повідомленням buzznodes.com про будь-яке
              таке несанкціоноване використання;
            </li>
            <li>
              не видаляти, не обходити, не здійснювати зворотний інжиніринг, не
              розшифровувати і не змінювати іншим чином і не втручатися в
              будь-які застосовні правила використання та не намагатися обійти
              функції керування цифровими правами та захисту від копіювання,
              пов'язані з Контентом або будь-якими іншими технологіями,
              використовувані для контролю доступу до Контенту або використання
              Контенту або його ідентифікаційної інформації;
            </li>
            <li>
              не використовувати жодні автоматизовані системи та засоби, за
              винятком наданих нами, для вибору або завантаження Контенту;
            </li>
            <li>
              не повідомляти свій токен або іншим чином дозволяти іншим особам
              отримувати доступ до Контенту. Обмеження на копіювання, які
              застосовуються до відповідних засобів, також застосовуються до
              Контенту, доступ до якого було отримано як до частини Сервісу.
            </li>
          </ul>
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Постачальник стороннього Контенту несе одноосібну відповідальність за
          будь-який розміщений ним Контент, включаючи будь-які гарантії, на які
          не поширюється відмова від відповідальності, або будь-які претензії,
          які можуть виникнути у зв'язку з Контентом або його використанням.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Надаючи вам Контент, buzznodes.com може діяти як агент постачальника
          стороннього Контенту. buzznodes.com не є стороною угоди між вами та
          постачальником стороннього Контенту щодо такого Контенту.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          6. Заяви про порушення авторських прав
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com поважає права інтелектуальної власності, що належать
          третім сторонам. Щоб повідомити про недотримання прав інтелектуальної
          власності, включаючи порушення авторських прав, скористайтеся
          процедурою надсилання повідомлення про порушення електронною поштою на
          support@buzznodes.com. Ми не реагуватимемо на запити, які були подані
          від адреси не зареєстрованої в Сервісі.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          7. Повідомлення
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com може розміщувати повідомлення на Сервісі.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com також може надсилати вам повідомлення про будь-які зміни
          та Сервіси електронною поштою або наданим вами Telegram ID.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Вважається, що ви отримали такі повідомлення після закінчення не
          більше 7 (семи) днів після надсилання або розміщення buzznodes.com
          такого повідомлення. Ваше подальше використання Сервісу означає, що ви
          отримали всі повідомлення, незалежно від методу відправки.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          8. Платежі
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Використання Сервісу може бути платним або може стати платним після
          закінчення терміну дії початкової пробної версії. Про будь-які
          платежі, що стягуються buzznodes.com у зв'язку із Сервісом, буде
          оголошено додатково.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ціни, які вказані на Сервісі, не включають платежів і комісій вашого
          постачальника платіжних послуг.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          9. Замовлення та умови оплати
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          «Замовлення» означає вибір підписки на Контент та Послуги, які
          пропонуються buzznodes.com та доступний на Сервісі, надання інформації
          про обраний метод оплати, а також розміщення замовлення натисканням
          кнопок «Купити», «ОК» або «Я приймаю», або інше аналогічне
          підтвердження ухвалення умов у процесі здійснення замовлення, або інша
          вказівка на прийняття умов, які представлені вам у процесі здійснення
          замовлення.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Для розміщення Замовлення на Сервісі ви повинні досягти віку
          дієздатності відповідно до чинного законодавства. Якщо ви ще не
          досягли віку дієздатності або повноліття, ви можете розміщувати
          Замовлення лише за попередньою згодою батька або законного опікуна.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ви погоджуєтесь з тим, що всі Замовлення мають законну силу. Усі
          Замовлення виконуються за умови прийняття buzznodes.com. Ви можете
          вносити оплату кредитною або дебетовою карткою, за протоколом TRC20
          або вибрати інший метод оплати, якщо є.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ви погоджуєтесь сплатити збори та комісії вашого постачальника
          платіжних послуг, пов'язані з вашим Замовленням, забезпечити дійсність
          платіжного засобу під час розміщення Замовлення, гарантуєте, що ви є
          законним власником такого засобу та що воно використовується у рамках
          кредитного ліміту.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Контент надається вам за передплатою. Ви погоджуєтесь використовувати
          такий Контент виключно у порядку, дозволеному цими Умовами та
          будь-якими додатковими умовами, які можуть бути представлені в ході
          розміщення замовлення.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ви дозволяєте Сервісу періодично стягувати плату протягом періоду
          передплати. На Сервісі може також пропонуватись пробний період. Якщо у
          Ваше замовлення включено пробний період (також може називатися
          «Trial»), плата може стягуватися після закінчення пробного періоду,
          якщо ви не відмовитеся від продукту відповідно до умов
          передплати/пробного періоду.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ціни на Сервісі можуть іноді змінюватися. Ціни включають застосовні
          податки, що діють на момент угоди, якщо не зазначено інше. Можливі
          випадки, коли ви будете нести додаткові витрати у зв'язку з курсом
          обміну валюти та/або додатковими зборами, що стягуються вашим банком
          або емітентом кредитної картки. buzznodes.com не несе жодної
          відповідальності за сплату таких комісій чи зборів банку чи будь-якої
          іншої третьої особи.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          10. Скасування та відшкодування
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ви погоджуєтесь на електронну передачу Контенту, яка починається
          одночасно із розміщенням вами Замовлення. Ви не зможете скасувати
          замовлення після його обробки. З огляду на свої особливості Контент не
          може бути повернутий.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Якщо після розміщення Замовлення ви виявите та негайно інформуєте
          buzznodes.com протягом 48 годин, що (a) замовлений Вами Контент
          містить дефекти; (b) Контент, доставлений вам buzznodes.com, не
          відповідає опису Контенту, який ви замовили через Сервіс, або (с)
          доставка вашого Контенту відбулася із затримкою або не відбулася
          внаслідок технічних проблем, або внаслідок технічних проблем було
          здійснено кілька випадкових замовлень, єдиним і винятковим засобом
          захисту ваших прав щодо такого Контенту є на повний розсуд
          buzznodes.com заміна або відшкодування вартості такого Контенту. В
          інших випадках повернення сплачених коштів не провадиться.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          У разі виникнення будь-яких із зазначених вище проблем зв'яжіться зі
          службою підтримки клієнтів buzznodes.com. Зверніть увагу, що служба
          підтримки клієнтів buzznodes.com може виявитися не в змозі обробити
          ваш запит на надання клієнтської підтримки, якщо ви не зможете вказати
          унікальних токен угоди, який надається вам buzznodes.com після
          розміщення Замовлення на Сервісі.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com може відшкодувати Контент лише у випадках, коли загальна
          вартість перевищує грошовий ліміт, передбачений відповідним місцевим
          законодавством.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          11. Відгуки, що надсилаються на адресу buzznodes.com
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Надаючи будь-які ідеї, відгуки та/або пропозиції («Відгук») в
          buzznodes.com за допомогою Сервісу або іншими способами, ви
          підтверджуєте та погоджуєтесь, що: (1) у buzznodes.com можуть бути
          ідеї з розробки, аналогічні Відгуку; (2) ваш відгук не містить
          конфіденційної інформації або інформації, що належить вам або
          будь-якій третій особі; (3) buzznodes.com не бере на себе зобов'язання
          щодо дотримання конфіденційності щодо Відкликання; (4) buzznodes.com
          може вільно використовувати, розповсюджувати, застосовувати та
          додатково розробляти або змінювати відгук у будь-яких цілях; (5) ви не
          маєте права на отримання будь-якої компенсації будь-якого характеру
          від buzznodes.com
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          12. Доступність та технічні вимоги
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Доступність Контенту та Сервісу може змінюватись та визначається на
          винятковий розсуд buzznodes.com. buzznodes.com прямо відмовляється від
          будь-яких запевнень чи гарантій щодо доступності будь-якого
          конкретного Контенту чи Сервісу. Доступність Сервісу залежить від
          регіону, Сервіс може надаватися лише певними мовами. Сервіс, операції
          та деякі функції також можуть залежати від мережі, сумісності
          пристроїв, що використовуються, а також підтримуваних форматів
          контенту.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com може, діючи на свій розсуд, повністю або частково
          змінювати, виправляти або припиняти роботу Сервісу. Під час перерв на
          технічне обслуговування та в інших випадках Сервіс може бути
          недоступним.ё
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Щоб гарантувати наявність на вашому пристрої останньої версії
          програмного забезпечення та програм, пристрій може перевіряти
          наявність оновлень програмного забезпечення від buzznodes.com. У разі
          їх виявлення вам буде надіслано повідомлення у Сервісі.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Якщо buzznodes.com вважатиме оновлення Програмного забезпечення
          важливим або критичним, ви не маєте права продовжувати використовувати
          попередню версію Програмного забезпечення. buzznodes.com може
          запобігти використанню попередньої версії Програмного забезпечення або
          Сервісу до встановлення оновлення.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com може заблокувати будь-який Контент або Програмне
          забезпечення, пов'язані з вашим обліковим записом на Сервісі, з
          будь-якої причини, та видалити будь-який Контент або Програмне
          забезпечення, та/або заблокувати копії будь-якої програми на вашому
          пристрої з метою захисту Сервісу, додатків постачальників через мережі
          яких ви отримуєте доступ до Сервісу, або будь-яких інших порушених чи
          потенційно порушених сторін.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Конкретний сервіс може бути попередньою версією, наприклад
          бета-версію, і тому його робота може відрізнятися від роботи
          остаточної версії. buzznodes.com може суттєво змінити будь-яку версію
          Сервісу або Програмного забезпечення або ухвалити рішення не випускати
          остаточну версію.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          13. Посилання на сайти та контент третіх осіб
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com може включати доступ до сайтів та сервісів в Інтернеті
          або встановлені клієнтські програми, які дозволяють взаємодіяти з
          сайтами та сервісами, що знаходяться у власності або під керуванням
          третіх осіб та не є частиною Сервісу.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ви повинні ознайомитися та погодитись з умовами використання таких
          сайтів чи сервісів до того, як ви почнете використовувати такі сайти
          чи сервіси. buzznodes.com не контролює контент, сайти чи сервіси
          третіх осіб і не несе жодної відповідальності за послуги, що надаються
          на цих сайтах чи сервісах третіх осіб, чи створювані чи публіковані на
          них матеріали. Посилання на сайт третьої особи не означає, що
          buzznodes.com схвалює цей сайт або продукти або послуги, що на ньому
          згадуються.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Крім того, ви та інші користувачі можете створювати на Сервісі контент
          або посилання на контент, який не був розміщений іншим чином на
          Сервісі. buzznodes.com не несе відповідальності за контент чи
          посилання цього типу.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          14. Обмеження відповідальності
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Сервіс надається на умовах «ЯК Є» та «ЗА МЕРОЮ ДОСТУПНОСТІ».
          buzznodes.com не гарантує, що Сервіс працюватиме безперервно і не
          міститиме помилок чи вірусів. Щодо доступності, точності, надійності,
          інформації чи вмісту Сервісу не надається жодної гарантії будь-якого
          роду, явної чи на увазі, включаючи, крім іншого, гарантії права
          власності, непорушення чи товарної придатності чи відповідності
          конкретної мети. Ви прямо погоджуєтесь і підтверджуєте, що
          використовуєте Сервіс виключно на власний ризик і що вам може бути
          показаний контент із різних джерел.
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          За винятком відповідальності за смерть або тілесні ушкодження,
          спричинені грубою недбалістю або навмисними неправомірними діями, ні
          за яких обставин buzznodes.com не нестиме відповідальності за будь-які
          непрямі, випадкові, штрафні або подальші збитки, спричинені
          використанням або неможливістю використання вами Сервісу.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          15. Відшкодування
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Ви погоджуєтесь звільнити buzznodes.com від відповідальності та
          відшкодувати їй шкоду у зв'язку з будь-якими позовами з боку третіх
          осіб та будь-якою відповідальністю, компенсацією, втратами, витратами
          або збитками, що виникли внаслідок або у зв'язку з (i) порушенням вами
          Умов, (ii) порушенням або недотриманням вами будь-яких прав на об'єкти
          інтелектуальної власності, інших прав або права на приватне життя
          третіх осіб або (iii) несанкціонованим використанням Сервісу третіми
          особами, якщо таке несанкціоноване використання стало можливим через
          неприйняття вами розумних заходів щодо захисту вашого імені
          користувача та пароля від зловживання.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          16. Інтелектуальна власність
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          Сервіс, Контент та Програмне забезпечення охороняються відповідно до
          міжнародних законів про авторські права. buzznodes.com заявляє
          авторські права на Сервіс, Контент та Програмне забезпечення у
          максимальному допустимому законом ступені. Відповідно до Умов
          buzznodes.com зберігає за собою всі права, права власності та інші
          права на Сервіс, Контент, Програмне забезпечення та всі інші продукти,
          програмне забезпечення та іншу власність buzznodes.com, надані вам або
          використовувані вами за допомогою Сервісу.
        </Typography>

        <Typography variant="h6" sx={{ mt: 4 }}>
          17. Поступка
        </Typography>
        <Typography variant="body2" sx={{ mt: 4 }}>
          buzznodes.com може поступитися своїми правами та зобов'язаннями за
          цими Умовами своєї материнської або однієї з дочірніх компаній або
          будь-якої компанії, яка перебуває під загальним контролем з
          buzznodes.com. Крім того, buzznodes.com може поступитися своїми
          правами та зобов'язаннями за цими Умовами третій особі у зв'язку зі
          злиттям, поглинанням, продажем активів, в силу закону або з інших
          обставин.
        </Typography>
      </DialogContent>

      <DialogActions sx={{ p: (theme) => `${theme.spacing(2.5)} !important` }}>
        <Button onClick={handleClose}>OK</Button>
      </DialogActions>
    </Dialog>
  );
};

export default TermsConditionsModalUk;
